CHOICES = (
    ('Коробка', 'Коробка'),
    ('Документы', 'Документы'),
    ('Гарантия', 'Гарантия'),
    ('Футляр', 'Футляр'),
    ('Зарядное устройство', 'Зарядное устройство'),
    ('Кабель USB', 'Кабель USB'),
)

CONDITION_CHOICES = (
    ('Хорошее', 'Хорошее'),
    ('Идеальное', 'Идеальное'),
    ('Новое', 'Новое'),
    ('Б/у', 'Б/у'),
    ('Требует восстановления', 'Требует восстановления'),
)

STYLE_CHOICES = (
    ('Повседневные', 'Повседневные'),
    ('Официальные', 'Официальные'),
    ('Спортивные', 'Спортивные'),
    ('Дайверские', 'Дайверские'),
    ('Ретро', 'Ретро'),
    ('Умные', 'Умные'),
    ('Классические', 'Классические'),
)

GENDER_CHOICES = (
    ('Мужские', 'Мужские'),
    ('Женские', 'Женские'),
    ('Унисекс', 'Унисекс'),
    ('Детские', 'Детские'),
)

GLASS_CHOICES = (
    ('Сапфировое', 'Сапфировое'),
    ('Минеральное', 'Минеральное'),
    ('Пластиковое', 'Пластиковое'),
    ('Кристалл', 'Кристалл'),
    ('Акриловое', 'Акриловое'),
)

CASE_MATERIAL_CHOICES = (
    ('Нержавеющая сталь', 'Нержавеющая сталь'),
    ('Золото', 'Золото'),
    ('Титан', 'Титан'),
    ('Пластик', 'Пластик'),
    ('Дерево', 'Дерево'),
)

COLOR_CHOICES = (
    ('Серебристый', 'Серебристый'),
    ('Черный', 'Черный'),
    ('Белый', 'Белый'),
    ('Серый', 'Серый'),
    ('Жёлтый', 'Жёлтый'),
    ('Зеленый', 'Зеленый'),
    ('Золотой', 'Золотой'),
    ('Коричневый', 'Коричневый'),
    ('Фиолетовый', 'Фиолетовый'),
    ('Синий', 'Синий'),
    ('Красный', 'Красный'),
    ('Оранжевый', 'Оранжевый'),
    ('Розовый', 'Розовый'),
    ('Голубой', 'Голубой'),
)

STRAP_MATERIAL_CHOICES = (
    ('Кожа', 'Кожа'),
    ('Нержавеющая сталь', 'Нержавеющая сталь'),
    ('Резина', 'Резина'),
    ('Металлический', 'Металлический'),
    ('Силикон', 'Силикон'),
)

CASE_SHAPE_CHOICES = (
    ('Круглый', 'Круглый'),
    ('Квадратный', 'Квадратный'),
    ('Прямоугольный', 'Прямоугольный'),
    ('Восьмиугольный', 'Восьмиугольный'),
    ('Овальный', 'Овальный'),
)

WATER_RESISTANCE_CHOICES = (
    ('30 метров', '30 метров'),
    ('50 метров', '50 метров'),
    ('100 метров', '100 метров'),
    ('200 метров', '200 метров'),
    ('300 метров и выше', '300 метров и выше'),
    ('Не водонепроницаемые', 'Не водонепроницаемые'),
)

MOVEMENT_CHOICES = (
    ('Автоматический', 'Автоматический'),
    ('Кварцевый', 'Кварцевый'),
    ('Механический', 'Механический'),
    ('Цифровой', 'Цифровой'),
    ('Смарт-механизм', 'Смарт-механизм'),
)

RATING_CHOICES = (
    (5, "Отлично"),
    (4, "Хорошо"),
    (3, "Удовлетворительно"),
    (2, "Плохо"),
    (1, "Ужасно"),
)
